*** Importing Packages

You can import multiple packages by grouping them in parentheses:

#+begin_src go
package main

import (
"fmt"
"math"
)

func main() {
fmt.Println(math.Sqrt(16))
}
#+end_src

#+RESULTS:
: 4

*** Alias Imports

Sometimes, you may encounter package names that conflict or are too long. You can use an alias when importing a package:

#+begin_src go
package main

import (
f "fmt"
)

func main() {
f.Println("Using an alias for fmt!")
}
#+end_src

#+RESULTS:
: Using an alias for fmt!

*** Basics

Maps are created using the `make` function:

#+begin_src go
package main

import "fmt"

func main() {
    m := make(map[string]int)
    m["apple"] = 42
    fmt.Println(m["apple"]) // Outputs: 42
}
#+end_src

#+RESULTS:
: 42

*** Zero Values

Accessing an element of a map by a key that doesn't exist returns the zero value for its type:

#+begin_src go
package main

import "fmt"

func main() {
    m := make(map[string]int)
    fmt.Println(m["banana"]) // Outputs: 0 (because "banana" hasn't been set and the zero value for int is 0)
}
#+end_src

#+RESULTS:
: 0

*** Checking for Existence

You can check if a key exists in the map with a two-value assignment:

#+begin_src go
package main

import "fmt"

func main() {
    m := make(map[string]int)
    m["apple"] = 42

    value, exists := m["banana"]
    if exists {
        fmt.Println(value)
    } else {
        fmt.Println("Key does not exist.")
    }
}
#+end_src

#+RESULTS:
: Key does not exist.

*** Iterating Over a Map

You can iterate over a map using a for loop with the `range` keyword:

#+begin_src go
package main

import "fmt"

func main() {
    m := map[string]int{
        "apple":  42,
        "banana": 50,
    }

    for key, value := range m {
        fmt.Printf("Key: %s, Value: %d\n", key, value)
    }
}
#+end_src

#+RESULTS:
: Key: apple, Value: 42
: Key: banana, Value: 50

*** Nested structs
#+begin_src go
package main
import "fmt"

type Address struct {
	DoorNumber uint32
	Street string
}

type Person struct {
	Age int32
	Name string
	Address Address
}

func main(){
	bob := Person{Age:100, Name: "Bob", Address: Address{DoorNumber: 1, Street: "Foo street"}}

	fmt.Println(bob,"\n")
	fmt.Println(bob.Age)
	fmt.Println(bob.Name)
	fmt.Println(bob.Address)
}

#+end_src

#+RESULTS:
: {100 Bob {1 Foo street}}
:
: 100
: Bob
: {1 Foo street}

*** Code Example (basic)
#+begin_src go
package main

import "fmt"

func main() {
    defer fmt.Println("World!")
    fmt.Println("Hello,")
}
#+end_src

#+RESULTS:
: Hello,
: World!

*** Code Example (stack)
#+begin_src go
package main

import "fmt"

func main() {
	defer fmt.Println("Calling defer #1")
	defer fmt.Println("Calling defer #2")
	defer fmt.Println("Calling defer #3")
	defer fmt.Println("Calling defer #4")
	fmt.Println("These should be called like a stack, first in last out")
}

#+end_src

#+RESULTS:
: These should be called like a stack, filo style
: Calling defer #4
: Calling defer #3
: Calling defer #2
: Calling defer #1

